; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star1 - direction
	Star2 - direction
	GroundStation6 - direction
	Star7 - direction
	Star0 - direction
	GroundStation3 - direction
	Star8 - direction
	GroundStation9 - direction
	Star5 - direction
	Star4 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation9)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(have_image Phenomenon10 thermograph3)
	(have_image Phenomenon11 infrared1)
	(have_image Planet12 thermograph0)
	(have_image Star13 thermograph2)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon16 thermograph3)
))

)

; plan
1. (turn_to satellite0 groundstation9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon15 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon15 instrument1 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon11 instrument1 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 2 of 7
8. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
10. (turn_to satellite0 star0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star0)
   goals met: 2 of 7
11. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 7
12. (turn_to satellite0 phenomenon16 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 7
13. (take_image satellite0 phenomenon16 instrument0 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 3 of 7
14. (turn_to satellite0 planet12 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet12)
   goals met: 3 of 7
15. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 4 of 7
16. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
17. (take_image satellite0 star13 instrument0 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 5 of 7
18. (turn_to satellite0 phenomenon10 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 7
19. (take_image satellite0 phenomenon10 instrument0 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 7 of 7
